# RevisionCloudRevisionNum Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RevisionCloudRevisionNum Property
ParameterTypeId Class See Also
---
"Revision Number"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RevisionCloudRevisionNum { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RevisionCloudRevisionNum As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RevisionCloudRevisionNum {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace